#იტერაცია არის ერთი და იგივე მოქმედების განმეორება რამდენჯერმე.
#ალგორითმი არის ნაბიჯების თანმიმდევრობა, რომელიც კონკრეტული ამოცანის გადასაჭრელად გამოიყენება.
#მაგალითად: რაიმე საჭმლის მომზადების რეცეპტი, ჩაის მომზადება, გზის პოვნა google maps-ში.
#ალგორითმების აღწერის ხერხები: ტექსტური, ბლოკ-სქემები, პსევდოკოდი.

for i in range(25):
    print("for loop")

for i in range(25, 76):
    print(i)

for i in range(40, 91):
    print(i)

for i in range(25, 151, 4):
    print(i)

for i in range(100, 1001, 10):
    print(i)

    for i in range(1, 101):
        print(i, "პითონი მაგარია")